import img1 from '../../../../public/images/boxes/boxes_section/box.jpg';
import img2 from '../../../../public/images/boxes/boxes_section/box2.jpg';
import img3 from '../../../../public/images/boxes/boxes_section/boxes3.jpg';
import img4 from '../../../../public/images/boxes/boxes_section/boxes4.jpg';

export interface BoxI {
  id: string;
  img: string[];
  title: string;
  price: number;
  link: string;
  text: string;
  description: string;
}

const price = 355;

const description =
  'Бокс "Стандарт" - це ваша можливість підняти свій рівень у світі свічкового мистецтва та вразити всіх красою та ароматом свічки.';

const BagsData: BoxI[] = [
  {
    id: '1',
    img: [img1.src, img1.src, img1.src],
    title: 'Бокс - Мінімал',
    price,
    link: '/boxes',
    text: `Ваш Перший Крок до Творчості зі Свічками! Іноді все велике починається з малого. Наш бокс "Мінімал" - це ваша можливість спробувати свій талант у створенні свічок без зайвих складнощів. Ви знайдете все необхідне для вашого першого витвору тут, і ваша подорож у світ свічкового мистецтва розпочнеться з легкості та задоволення.`,
    description,
  },
  {
    id: '2',
    img: [img2.src, img2.src, img2.src],
    title: 'Бокс - Стандарт                                                  ',
    price,
    link: '/boxes',
    text: `Крок до Справжньої Майстерності в Свічковому Мистецтві!  Готові підняти планку і стати справжнім майстром свічок? Наш бокс "Стандарт" - це ваша можливість розкрити весь світ можливостей та виразити свою творчість через створення свічок. У цьому боксі вас чекає все необхідне, щоб стати справжнім професіоналом у світі свічкового мистецтва.`,
    description,
  },
  {
    id: '3',
    img: [img3.src, img3.src, img3.src],
    title: 'Бокс - Стандарт ПРО',
    price,
    link: '/boxes',
    text: `Ваш Вищий Рівень Майстерності в Свічковому Мистецтві! Якщо ви прагнете до справжньої майстерності у світі створення свічок, то бокс "Стандарт Pro" - це ваш найкращий вибір. Він містить у собі усі необхідні інструменти та матеріали, щоб ви могли створити свої шедевральні свічки і долучитися до еліти свічкових майстрів.`,
    description,
  },
  {
    id: '4',
    img: [img4.src, img4.src, img4.src],
    title: 'Бокс - Дабл ПРО',
    price,
    link: '/boxes',
    text: `Подвійна Доза Творчості у Свічковому Мистецтві!Ви не готові зупинятися на одній свічці? Тоді бокс "Дабл Про" - це ваша найкраща можливість подарувати собі подвійну порцію творчості у створенні свічок. У цьому боксі ви знайдете все, щоб створити дві унікальні свічки та поділитися ними з близькими.`,
    description,
  },
];

export default BagsData;
